#include <cstdio>

/*
就是求n條線最多能切出幾塊平面
結論: 每一條線都有與其他條線有交點如此可切出最多平面
1刀: 1 + 1 = 2
2刀: 1 + 1 + 2 = 4
3刀: 1 + (1 + 2 + 3) = 7
4刀: 1 + (1 + 2 + 3 + 4) = 11
5刀: 1 + (1 + 2 + 4 + 4 + 5) = 16
...
公式: n刀 -> 1 + (1 + 2 + ... + n) = 1 + (n + 1) * n / 2

另解:
    任兩條直線不平行，任三條不共點
    第n條直線會比前n - 1條多出C(n, 2) - C(n - 1, 2)個交點
    此C(n, 2) - C(n - 1, 2)個交點會將第n條線分成C(n, 2) - C(n - 1, 2) + 1段
    又每一段將該區分成兩區
    所以
    a(1) = 2
    a(2) = a(1) + (C(2, 2) + 1)
    a(3) = a(2) + (C(3, 2) - C(2, 2) + 1)
    ...
    a(n) = a(n - 1) + (C(n, 2) - C(n - 1, 2) + 1) = a(n - 1 + n)
    全部相加並移項整理可得
    a(n) = 2 + (n - 1) + C(n, 2)
        = 1 + n + C(n, 2)
        = C(n, 0) + C(n, 1) + C(n, 2)
        = 1 + (n + 1) * n / 2

*/

int main()
{
    long long n;
    while (scanf("%lld", &n) && n >= 0)
    {
        printf("%lld\n", (1 + (n + 1) * n / 2));
    }
    return 0;
}