#include <bits/stdc++.h>
using namespace std;

/*
題意:
    城市是 m x m 的，路都是水平跟垂直的
    餐廳都開在相交點上
    在城市中有兩個大公寓A、B在同一個水平線上(題目會給定兩間的座標)
    且A、B公寓各自已經有餐廳在那邊

    在這一題中距離使用曼哈頓距離

    因為兩邊的公寓居民經常開會，
    所以將新餐廳開在兩個公寓之間是好選擇
    但是只保留被認為是good place的地方
    good place的定義是:

    假設p是good place，q是某間已經存在的餐廳，dist(p, q)是p與q的曼哈頓距離
    只有當 for each q
    dist(p, A) < dist(q, A) or dist(p, B) < dist(q, B)

    換句話說
    p不是good place時存在一間餐廳q滿足
    dist(p, A) >= dist(q, A) and dist(p, B) >= dist(q, B)

    也就是只有當p到A或p到B的距離之中有一個能夠比所有人短時才是good place

    考慮地圖:

    *—*—*—*—*—*—*—*—*—*—*
    | | | | | | | | | | |
    *—*—*—*—*—*—*—*—*—*—*
    | | | | | | | | | | |
    *—*—*—*—*—*—*—*—*—*—*
    | | | | | | | | | | |
    *—*—*—*—*—*—*—*—*—*—*
    | | | | | | | | | | |
    *—*—*—*—*—*—*—*—*—*—*
    | | | | | | | | | | |
    A—*—*—*—*—*—*—*—*—*—B
    | | | | | | | | | | |
    *—*—*—*—*—*—*—*—*—*—*
    | | | | | | | | | | |
    *—*—*—*—*—*—*—*—*—*—*
    | | | | | | | | | | |
    *—*—*—*—*—*—*—*—*—*—*
    | | | | | | | | | | |
    *—*—*—*—*—*—*—*—*—*—*
    | | | | | | | | | | |
    *—*—*—*—*—*—*—*—*—*—*
      ^ ^ ^ ^ ^ ^ ^ ^ ^
    給定A、B，good place只可能在^的column
    因為A、B上都有餐廳，如果開在A或B的column上，那麼到A和B的距離都會輸給B和A(相對應地)

    *—*—*—*—*—*—*—*—*—*—*
    | | | | | | | | | | |
    *—*—*—*—*—*—*—*—*—*—*
    | | | | | | | | | | |
    *—*—*—*—*—*—*—*—*—*—*
    | | | | | | | | | | |
    *—*—*—*—*—*—*—*—*—*—*
    | | | | | | | | | | |
    *—*—*—*—*—*—*—*—*—*—*
    | | | | | | | | | | |
    A—*—*—*—*—*—*—*—*—*—B
    | | | | | | | | | | |
    *—*—*—*—*—*—*—*—*—*—*
    | | | | | | | | | | |
    *—*—*—*—*—O—*—*—*—*—*
    | | | | | | | | | | |
    *—*—*—*—X—X—X—*—*—*—*
    | | | | | | | | | | |
    *—*—*—X—X—X—X—X—*—*—*
    | | | | | | | | | | |
    *—*—X—X—X—X—X—X—X—*—*

    現在假設在O的位置上有一家餐廳
    那麼在O後面對角線的範圍內都不會是good place
    這是因為曼哈頓距離是菱形
    所以在O以及O後面對角線上到A和B的距離會與是一樣或比較遠的(看推導1.png)

    因此這題的解法就是利用這樣的對角線性質
    維護所有餐廳帶來的限制
    然後再將每個column還能夠蓋的位置數量加起來(看推導2.png)
*/

struct Point
{
    int x, y;
};

Point A, B;

// 每個colum被餐廳限制的高度(高度會上下對稱)
int minH[60005];

int main()
{
    int T;
    scanf("%d", &T);

    while (T--)
    {
        int m, n;
        scanf("%d %d", &m, &n);
    
        scanf("%d %d", &A.x, &A.y);
        scanf("%d %d", &B.x, &B.y);

        memset(minH, 0x3f, sizeof(minH));

        for (int i = 2; i < n; ++i)
        {
            int x, y;
            scanf("%d %d", &x, &y);

            // 只需要管比A更右邊，比B更左邊的餐廳
            if (x <= A.x || x >= B.x)
                continue;
            
            // 在這個column上要嘛是之前的，不然就是新的餐廳會導致更低(-1)
            // 然後這裡會將y重新轉換成高度
            minH[x] = min(minH[x], abs(y - A.y) - 1);
        }

        // 初始化要-1，因為A的高度是0
        minH[A.x] = -1;
        // 一定比A更右邊，比B更左邊
        // 從左到右維護高度(對角線，所以每個後面一格就能上去一點點)
        for (int i = A.x + 1; i < B.x; ++i)
            minH[i] = min(minH[i], minH[i - 1] + 1);
        // 初始化要-1，因為B的高度是0
        minH[B.x] = -1;
        // 一定比A更右邊，比B更左邊
        // 然後還要從右到左維護高度一次，不然高度不會受到兩邊限制
        for (int i = B.x - 1; i > A.x; --i)
            minH[i] = min(minH[i], minH[i + 1] + 1);

        int res = 0;

        // 將所有位置加起來
        for (int i = A.x + 1; i < B.x; ++i)
        {
            if (minH[i] == -1)
                continue;
            
            // 避免高出題意範圍
            int high = min(m - 1, A.y + minH[i]);
            int low = max(0, A.y - minH[i]);

            res += high - low + 1;
        }

        printf("%d\n", res);
    }

    return 0;
}